>>> Link reference definitions - 161
[foo]: /url "title"

[foo]
<<<
<p><a href="/url" title="title">foo</a></p>
>>> Link reference definitions - 162
   [foo]: 
      /url  
           'the title'  

[foo]
<<<
<p><a href="/url" title="the title">foo</a></p>
>>> Link reference definitions - 163
[Foo*bar\]]:my_(url) 'title (with parens)'

[Foo*bar\]]
<<<
<p><a href="my_(url)" title="title (with parens)">Foo*bar]</a></p>
>>> Link reference definitions - 164
[Foo bar]:
<my url>
'title'

[Foo bar]
<<<
<p>[Foo bar]:
<my url>
'title'</p>
<p>[Foo bar]</p>
>>> Link reference definitions - 165
[foo]: /url '
title
line1
line2
'

[foo]
<<<
<p><a href="/url" title="
title
line1
line2
">foo</a></p>
>>> Link reference definitions - 166
[foo]: /url 'title

with blank line'

[foo]
<<<
<p>[foo]: /url 'title</p>
<p>with blank line'</p>
<p>[foo]</p>
>>> Link reference definitions - 167
[foo]:
/url

[foo]
<<<
<p><a href="/url">foo</a></p>
>>> Link reference definitions - 168
[foo]:

[foo]
<<<
<p>[foo]:</p>
<p>[foo]</p>
>>> Link reference definitions - 169
[foo]: <>

[foo]
<<<
<p><a href="<>">foo</a></p>
>>> Link reference definitions - 170
[foo]: <bar>(baz)

[foo]
<<<
<p><a href="bar" title="baz">foo</a></p>
>>> Link reference definitions - 171
[foo]: /url\bar\*baz "foo\"bar\baz"

[foo]
<<<
<p>[foo]: /url\bar*baz "foo&quot;bar\baz"</p>
<p>[foo]</p>
>>> Link reference definitions - 172
[foo]

[foo]: url
<<<
<p><a href="url">foo</a></p>
>>> Link reference definitions - 173
[foo]

[foo]: first
[foo]: second
<<<
<p><a href="first">foo</a></p>
>>> Link reference definitions - 174
[FOO]: /url

[Foo]
<<<
<p><a href="/url">Foo</a></p>
>>> Link reference definitions - 175
[ΑΓΩ]: /φου

[αγω]
<<<
<p><a href="/φου">αγω</a></p>
>>> Link reference definitions - 176
[foo]: /url
<<<

>>> Link reference definitions - 177
[
foo
]: /url
bar
<<<
<p>bar</p>
>>> Link reference definitions - 178
[foo]: /url "title" ok
<<<
<p>[foo]: /url "title" ok</p>
>>> Link reference definitions - 179
[foo]: /url
"title" ok
<<<
<p>"title" ok</p>
>>> Link reference definitions - 180
    [foo]: /url "title"

[foo]
<<<
<pre><code>[foo]: /url "title"
</code></pre>
<p>[foo]</p>
>>> Link reference definitions - 181
```
[foo]: /url
```

[foo]
<<<
<pre><code>[foo]: /url
</code></pre>
<p>[foo]</p>
>>> Link reference definitions - 182
Foo
[bar]: /baz

[bar]
<<<
<p>Foo
[bar]: /baz</p>
<p>[bar]</p>
>>> Link reference definitions - 183
# [Foo]
[foo]: /url
> bar
<<<
<h1><a href="/url">Foo</a></h1>
<blockquote>
<p>bar</p>
</blockquote>
>>> Link reference definitions - 184
[foo]: /url
bar
===
[foo]
<<<
<h1>[foo]: /url
bar</h1>
<p>[foo]</p>
>>> Link reference definitions - 185
[foo]: /url
===
[foo]
<<<
<h1>[foo]: /url</h1>
<p>[foo]</p>
>>> Link reference definitions - 186
[foo]: /foo-url "foo"
[bar]: /bar-url
  "bar"
[baz]: /baz-url

[foo],
[bar],
[baz]
<<<
<p><a href="/foo-url" title="foo">foo</a>,
<a href="/bar-url" title="bar">bar</a>,
<a href="/baz-url">baz</a></p>
>>> Link reference definitions - 187
[foo]

> [foo]: /url
<<<
<p><a href="/url">foo</a></p>
<blockquote>
</blockquote>
>>> Link reference definitions - 188
[foo]: /url
<<<

