>>> Link reference definitions - 192
[foo]: /url "title"

[foo]
<<<
<p><a href="/url" title="title">foo</a></p>
>>> Link reference definitions - 193
   [foo]: 
      /url  
           'the title'  

[foo]
<<<
<p><a href="/url" title="the title">foo</a></p>
>>> Link reference definitions - 194
[Foo*bar\]]:my_(url) 'title (with parens)'

[Foo*bar\]]
<<<
<p><a href="my_(url)" title="title (with parens)">Foo*bar]</a></p>
>>> Link reference definitions - 195
[Foo bar]:
<my url>
'title'

[Foo bar]
<<<
<p>[Foo bar]:
<my url>
'title'</p>
<p>[Foo bar]</p>
>>> Link reference definitions - 196
[foo]: /url '
title
line1
line2
'

[foo]
<<<
<p><a href="/url" title="
title
line1
line2
">foo</a></p>
>>> Link reference definitions - 197
[foo]: /url 'title

with blank line'

[foo]
<<<
<p>[foo]: /url 'title</p>
<p>with blank line'</p>
<p>[foo]</p>
>>> Link reference definitions - 198
[foo]:
/url

[foo]
<<<
<p><a href="/url">foo</a></p>
>>> Link reference definitions - 199
[foo]:

[foo]
<<<
<p>[foo]:</p>
<p>[foo]</p>
>>> Link reference definitions - 200
[foo]: <>

[foo]
<<<
<p><a href="<>">foo</a></p>
>>> Link reference definitions - 201
[foo]: <bar>(baz)

[foo]
<<<
<p><a href="bar" title="baz">foo</a></p>
>>> Link reference definitions - 202
[foo]: /url\bar\*baz "foo\"bar\baz"

[foo]
<<<
<p>[foo]: /url\bar*baz "foo&quot;bar\baz"</p>
<p>[foo]</p>
>>> Link reference definitions - 203
[foo]

[foo]: url
<<<
<p><a href="url">foo</a></p>
>>> Link reference definitions - 204
[foo]

[foo]: first
[foo]: second
<<<
<p><a href="first">foo</a></p>
>>> Link reference definitions - 205
[FOO]: /url

[Foo]
<<<
<p><a href="/url">Foo</a></p>
>>> Link reference definitions - 206
[ΑΓΩ]: /φου

[αγω]
<<<
<p><a href="/φου">αγω</a></p>
>>> Link reference definitions - 207
[foo]: /url
<<<

>>> Link reference definitions - 208
[
foo
]: /url
bar
<<<
<p>bar</p>
>>> Link reference definitions - 209
[foo]: /url "title" ok
<<<
<p>[foo]: /url "title" ok</p>
>>> Link reference definitions - 210
[foo]: /url
"title" ok
<<<
<p>"title" ok</p>
>>> Link reference definitions - 211
    [foo]: /url "title"

[foo]
<<<
<pre><code>[foo]: /url "title"
</code></pre>
<p>[foo]</p>
>>> Link reference definitions - 212
```
[foo]: /url
```

[foo]
<<<
<pre><code>[foo]: /url
</code></pre>
<p>[foo]</p>
>>> Link reference definitions - 213
Foo
[bar]: /baz

[bar]
<<<
<p>Foo
[bar]: /baz</p>
<p>[bar]</p>
>>> Link reference definitions - 214
# [Foo]
[foo]: /url
> bar
<<<
<h1><a href="/url">Foo</a></h1>
<blockquote>
<p>bar</p>
</blockquote>
>>> Link reference definitions - 215
[foo]: /url
bar
===
[foo]
<<<
<h1>[foo]: /url
bar</h1>
<p>[foo]</p>
>>> Link reference definitions - 216
[foo]: /url
===
[foo]
<<<
<h1>[foo]: /url</h1>
<p>[foo]</p>
>>> Link reference definitions - 217
[foo]: /foo-url "foo"
[bar]: /bar-url
  "bar"
[baz]: /baz-url

[foo],
[bar],
[baz]
<<<
<p><a href="/foo-url" title="foo">foo</a>,
<a href="/bar-url" title="bar">bar</a>,
<a href="/baz-url">baz</a></p>
>>> Link reference definitions - 218
[foo]

> [foo]: /url
<<<
<p><a href="/url">foo</a></p>
<blockquote>
</blockquote>
