>>> simple highlight
Foo ==bar== baz
<<<
<p>Foo <mark>bar</mark> baz</p>
>>> left- and right-flanking has differnt ammount of indicators
Foo ===bar== baz
<<<
<p>Foo =<mark>bar</mark> baz</p>
>>> Intraword highlight
==foo==bar
<<<
<p><mark>foo</mark>bar</p>
>>> with emphasis
==**foo**==
<<<
<p><mark><strong>foo</strong></mark></p>
>>> not a highlight, ending == is preceded by punctuation and followed by an alphanumeric
==***foo***==bar
<<<
<p>==<em><strong>foo</strong></em>==bar</p>
>>> not a highlight, invalid right-flanking
Foo ==bar == baz
<<<
<p>Foo ==bar == baz</p>